# **Caso número 3**

## **Estudiantes:**

*   Marco Fonseca
*   Emmanuel Arguedas

## 1. **Importar el CSV data.csv en Python. El delimitador de los valores es (;).**

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.read_csv('/content/drive/MyDrive/CSV Files/data (5).csv', sep=";")

## 2. **Mostrar los valores los primeros 5 valores del dataframe**

In [ ]:
df.head(n=5)

   id    FirstName LastName  ... HourlyRate MaritalStatus OverTime
0   1    Kimberley    Kuhic  ...         40        Single      Yes
1   1        Kitty  Ruecker  ...         76       Married       No
2   5        Jamal     Cole  ...         89        Single      Yes
3   5  Christopher  D'Amore  ...         78       Married       No
4   5        Carly    Ratke  ...         86        Single      Yes

[5 rows x 12 columns]

## 3. **Mostrar los últimos 5 valores del dataframe**

In [ ]:
df.tail(n=5)

      id FirstName  LastName  ... HourlyRate MaritalStatus OverTime
995  996    Linnie    Larson  ...         92        Single      Yes
996  997    Agusta  Emmerich  ...         91      Divorced       No
997  997    Andrew  Schulist  ...         34        Single       No
998  997     Brook    Turner  ...         49       Married       No
999  999     Maceo    Wisoky  ...         33       Married       No

[5 rows x 12 columns]

## 4. **Mostrar el tipo de dato (Dtype) de cada columna**

In [ ]:
df.dtypes

id                 int64
FirstName         object
LastName          object
Gender            object
Birthday          object
Status            object
Salary           float64
Taxes             object
Department        object
HourlyRate        object
MaritalStatus     object
OverTime          object
dtype: object

## 5. **Mostrar la cantidad de valores nulos de cada columna**

In [ ]:
df.isnull().sum(axis = 0)

id                 0
FirstName          2
LastName           2
Gender           207
Birthday           2
Status           178
Salary             2
Taxes            993
Department        12
HourlyRate         2
MaritalStatus     25
OverTime           2
dtype: int64

## 6. **Mostrar el porcentaje total de valores perdidos en todo el dataframe**

In [ ]:
data_count = np.product(df.shape)
percent_of_df_nulls = ((df.isnull().sum().sum() / data_count)*100)

print(percent_of_df_nulls)

11.891666666666667

## 7. **Mostrar el porcentaje de valores perdidos por columna**

In [ ]:
percent_of_nulls_per_column = ((df.isnull().sum() / len(df))*100).sort_values(ascending = False) 

print(percent_of_nulls_per_column)

Taxes            99.3
Gender           20.7
Status           17.8
MaritalStatus     2.5
Department        1.2
OverTime          0.2
HourlyRate        0.2
Salary            0.2
Birthday          0.2
LastName          0.2
FirstName         0.2
id                0.0
dtype: float64

## 8. **Eliminar aquellas columnas que tengan más del 70% de sus valores nulos.**

In [ ]:
df.drop('Taxes', axis = 1, inplace = True)

## **9. Eliminar aquellas filas que tengan menos de dos elementos**

Rows vacias

In [ ]:
print(df.iloc[[182,592]])

      id FirstName LastName Gender  ... Department HourlyRate  MaritalStatus OverTime
182  188       NaN      NaN    NaN  ...        NaN        NaN            NaN      NaN
592  592       NaN      NaN    NaN  ...        NaN        NaN            NaN      NaN

[2 rows x 11 columns]

Eliminar Rows Vacías

In [ ]:
df.drop([182,592], axis=0, inplace=True)

## **10.Reemplace los String “--" por valores nulos**

In [ ]:
valores_faltants = ["--"]
df = pd.read_csv('/content/drive/MyDrive/CSV Files/data (5).csv', sep=";", na_values = valores_faltants)
df.head()

   id    FirstName LastName  ... HourlyRate MaritalStatus OverTime
0   1    Kimberley    Kuhic  ...       40.0        Single      Yes
1   1        Kitty  Ruecker  ...       76.0       Married       No
2   5        Jamal     Cole  ...       89.0        Single      Yes
3   5  Christopher  D'Amore  ...       78.0       Married       No
4   5        Carly    Ratke  ...       86.0        Single      Yes

[5 rows x 12 columns]

## **11. Reemplazar los valores nulos de la columna de “Gender” por U (Unknown) para aquellos empleados que no especificaron este campo**

In [ ]:
df['Gender'].fillna("U", inplace=True)

## **12. Reemplazar los valores nulos de la columna “Departamento” por “Bench”**

In [ ]:
df = df.fillna({'Department': 'Bench'})

## **13. Reemplazar los valores nulos de la columna “HourlyRate” por la mediana**

In [ ]:
esta_es_la_mediana = df['HourlyRate'].median()
df['HourlyRate'].fillna(esta_es_la_mediana, inplace=True)

## **14. Reemplazar los valores perdidos inesperados de la columna “Overtime” por No**

In [ ]:
counter=0
for row in df['OverTime']:
    try:
        int(row)
        df.loc[counter, 'OverTime']=np.nan
    except ValueError:
        pass
    counter=1

## **15. Salvar el dataframe una vez realizado el procesamiento de los puntos anteriores**

In [ ]:
df.to_csv('data.csv')
!cp data.csv "/content/drive/MyDrive/Case 3 Data (Clean)"

# **16. Documentarción.**

Iniciamos como cualquier proyecto de este estilo, importando la data que elegimos, o como lo es en este caso, la que nos brindaron, despues de eso, comenzamos a trabajar la data brindada.
El segundo punto pide mostrar los valores los primeros 5 valores del dataframe, mediante la función head(5), que nos permitirá ver los primeros 5 valores.
El tercer punto nos pide mostrar los utlimos 5 puntos del dataframe, mediante la funcion tail, que por si misma nos muestra los ultimos 5 valores.
El cuarto punto trata de mostrar el tipo de dato (Dtype) de cada columna, que con la función Dtype, nos permitirá efectuar lo pedido.
El quinto punto pide mostrar la cantidad de valores nulos de cada columna, que para ver los valores nulos, se utilizará la función isnull().sum(axis = 0) para mostrar los valores nulos de cada columna.
El sexto punto pide mostrar el porcentaje total de valores perdidos en todo el dataframe. aqui lo que se hace en el codigo es contar los valores, pero especificaremos en el codigo que solo queremos los nulos con su porcentaje.
El punto siete solicita mostrar el porcentaje de valores perdidos por columnas, primero solicitamos el porcentaje de valore nulos por columna mediante este código "((df.isnull().sum() / len(df))*100).sort_values(ascending = False) 

print(percent_of_nulls_per_column)"
Apartir del punto 8, nos encargamos de limpiar la data, en este caso con este código drop "('Taxes', axis = 1, inplace = True)", para eliminar aquellas columnas que tengan más del 70% de sus valores nulos.
El punto 9 trata de limpieza también, mediante print(df.iloc[[182,592]]) llamamos las filas y con drop([182,592], axis=0, inplace=True) nos encargamos de borrar las filas vacias.
El punto 10 utilizamos el código valores_faltants = ["--"]
df = pd.read_csv('/content/drive/MyDrive/CSV Files/data (5).csv', sep=";", na_values = valores_faltants)
df.head(), para remplazar los valores, por guiones (--), para así tener de cierta manera una data más limpia.
El punto 11 ['Gender'].fillna("U", inplace=True), para reemplazar los valores nulos de la columna de “Gender” por U=unknowun para aquellos empleados que no especificaron este campo.
El punto 12 fillna({'Department': 'Bench'}) utilizamos este código, para reemplazar los valores nulos de la columna "Departamento" por "Brench".
El punto 13 ['HourlyRate'].median()
df['HourlyRate'].fillna(esta_es_la_mediana, inplace=True), esto lo que nos permitirá es realizar los valores nulos de la columna "HourleyRate" por la mediana.
En el punto 14 implementamos este código. counter=0
for row in df['OverTime']:
    try:
        int(row)
        df.loc[counter, 'OverTime']=np.nan
    except ValueError:
        pass
    counter=1
Con el cual reemplazamos los valores perdidos inesperados de la columna "Overtime" por un NO
En el punto 15 to_csv('data.csv')
!cp data.csv "/content/drive/MyDrive/Case 3 Data (Clean)" Aqui lo que hacemos es salvar los datos hechos en la limpieza, con los puntos anteriores hechos.

#17. Escoger la estructura de carpetas y la nomenclatura de las carpetas y los archivos para los datos sin procesar y los datos procesados, además el código de Python.
Todo, será guardado en una misma carpeta, para evitar que ocurra una perdida o tener todo mal distribuído.